title: Multiple Failed SSH Logins From Single Source
status: experimental
logsource:
  product: linux
  service: sshd  # which logs this applies to
detection:
  failed:
    message|contains: 'Failed password'  # the tell-tale text
  timeframe: 60s  # how long to count over
  condition: failed | count() > 5 by src_ip
level: high
tags:
  - attack.credential_access
  - attack.t1110
